In [189]:
import pandas as pd
import numpy as np

df1 = df = pd.DataFrame(np.random.randint(0,30,size=(4, 4)), columns=list('ABCD'))
df2 = df = pd.DataFrame(np.random.randint(0,50,size=(4, 4)), columns=list('ABCD'))

print (df1)
print ('\n')
print (df2)

    A   B   C   D
0   3   8  12  20
1  15  20  21  12
2   4   0  15   7
3   8  14  25  12


    A   B   C   D
0  29  23  40  28
1  26   1   8  18
2  11  30  43  30
3  36   9  40   9

# **Importar y exportar datos**

In [190]:
#Se puede importar datos desde varios tipos de archivo. Para ello se utilizar read_<extencion del archivo> ('direccion')
#Nota: el archivo puede estar alojado de forma local o remota.  
df = pd.read_csv("https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv")

print(df)

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]

In [191]:
#Para exportar un data frame se utiliza .to_<tipo de archivo>(<nombre del archivo>.<tipo de archivo>)
df.to_csv('paises.csv')

# **Limpieza de datos**

In [192]:
df3 = pd.DataFrame({'A':[23,18,54], 'B':[12,20,14], 'C':[30,22,36]})

In [193]:
#Se puede verificar si faltan valores de datos mediante .isnull()
df3.isnull()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False

In [194]:
#Se puede obtener una suma de valores faltantes con .sum()
df3.isnull().sum()

A    0
B    0
C    0
dtype: int64

In [195]:
#Para eliminar columnas donde hay datos perdidos se utilizar .dropna()
df3.dropna()

    A   B   C
0  23  12  30
1  18  20  22
2  54  14  36

In [196]:
#Para eliminar filas donde hay datos perdidos se utilizar .dropna(axis=1)
df3.dropna(axis=1)

    A   B   C
0  23  12  30
1  18  20  22
2  54  14  36

In [197]:
#Tambien se puede rellenar los valores nulos de un data frame con .fillna(<valor o variable a utilziar>)
df3.fillna(1)

    A   B   C
0  23  12  30
1  18  20  22
2  54  14  36

In [198]:
#Tambien se puede rellenar los valores nulos de un data frame con la media de los datos totales
df3.fillna(df3.mean())

    A   B   C
0  23  12  30
1  18  20  22
2  54  14  36

# **Operaciones Algebraicas**

In [199]:
#suma los dos dataframes, elemento por elemento
pd.DataFrame.add(df1,df2)

    A   B   C   D
0  32  31  52  48
1  41  21  29  30
2  15  30  58  37
3  44  23  65  21

In [200]:
#resta a un dataframe otro dataframe, elemento por elemento
pd.DataFrame.sub(df1,df2)

    A   B   C   D
0 -26 -15 -28  -8
1 -11  19  13  -6
2  -7 -30 -28 -23
3 -28   5 -15   3

In [201]:
#multiplica un dataframe por otro, elemento por elemento
pd.DataFrame.mul(df1,df2)

     A    B     C    D
0   87  184   480  560
1  390   20   168  216
2   44    0   645  210
3  288  126  1000  108

In [202]:
#divide un dataframe por otro, elemento por elemento
pd.DataFrame.div(df1,df2)

          A          B         C         D
0  0.103448   0.347826  0.300000  0.714286
1  0.576923  20.000000  2.625000  0.666667
2  0.363636   0.000000  0.348837  0.233333
3  0.222222   1.555556  0.625000  1.333333

In [203]:
#devuelve el resultado de calcular el módulo de un dataframe y otro dataframe, elemento por elemento
df2.mod(df1)

      A    B     C    D
0   2.0  7.0   4.0  8.0
1  11.0  1.0   8.0  6.0
2   3.0  NaN  13.0  2.0
3   4.0  9.0  15.0  9.0

In [204]:
#devuelve el resultado de calcular el módulo de un dataframe y otro dataframe, elemento por elemento
df1.dot([2,2,2,2])

0     86
1    136
2     52
3    118
dtype: int64

In [205]:
#devuelve una copia del dataframe conteniendo el valor absoluto de cada uno de sus valores
pd.DataFrame.abs(df1*(-2))

    A   B   C   D
0   6  16  24  40
1  30  40  42  24
2   8   0  30  14
3  16  28  50  24

# **Conocer un dataFrame**

In [206]:
#Para conocer la estrucutra de un data frame se utiliza .shape
df1.shape

(4, 4)

In [207]:
#Se puede extraer la cantidad de filas o columnas de un dataframe
print(len(df1.columns))
print(len(df1.index))

4
4

# **Manejo de estructuras**

In [208]:
#Se puede seleccionar una columna mediante indexacion
df1['A']

0     3
1    15
2     4
3     8
Name: A, dtype: int64

In [209]:
#Se pueden seleccionar varias columnas de manera similar usando un otro par de []
df1[['A','C']]

    A   C
0   3  12
1  15  21
2   4  15
3   8  25

In [210]:
#Extraer el valor de un elemento de un DataFrame
#Nota: la indexación se realiza mediante [columna][fila]
df1['A'][1]

15

In [211]:
#Tabien es posible utilizando indexacion mediante .iloc
#Nota: indexacion mediante [fila, columna]
df1.iloc[0,1]

8

In [212]:
#Otra forma de indexar es mediante .loc
#La diferencia con .iloc es que .loc admite etiquetas en su endexacion
#Nota: indexacion mediante [fila, columna]
df1.loc[0,'A']

3

In [213]:
#Se puede utilizar .iloc con dos puntos para seleccionar desde o hasta una fila
df1.iloc[1:3]

    A   B   C   D
1  15  20  21  12
2   4   0  15   7

# **Estadisticas básicas**

In [214]:
#Se puede obtener estadísticas descriptivas como media, meadiana, máx, mín, std y conteos para una columna en particular de los datos
#mediante la funcion .describe()
df1.describe()

               A          B         C          D
count   4.000000   4.000000   4.00000   4.000000
mean    7.500000  10.500000  18.25000  12.750000
std     5.446712   8.544004   5.85235   5.377422
min     3.000000   0.000000  12.00000   7.000000
25%     3.750000   6.000000  14.25000  10.750000
50%     6.000000  11.000000  18.00000  12.000000
75%     9.750000  15.500000  22.00000  14.000000
max    15.000000  20.000000  25.00000  20.000000

In [215]:
#Se puede saber el numero de valores no nulos en el drata frame con .count()
df1.count()

A    4
B    4
C    4
D    4
dtype: int64

In [216]:
#Se puede saber la media de todas las columnas utilizando mean()
df1.mean()

A     7.50
B    10.50
C    18.25
D    12.75
dtype: float64

In [224]:
#Para conecer la correlaccion entre dos columnas se utiliza .corr
df1['A'].corr(df1['B'])

0.8666990281388578

In [218]:
#Para conocer el valor maximo de cada columna se utiliza .max()
df1.max()

A    15
B    20
C    25
D    20
dtype: int64

In [219]:
#Para conocer el valor maximo de una columna basta con indexar y utilizar .max()
df1['A'].max()

15

In [220]:
#De igual forma se utiliza .min() 
df1.min()

A     3
B     0
C    12
D     7
dtype: int64

In [221]:
##
df1['A'].min()

3

In [222]:
#Se puede conocer la mediana de cada columna con .median(), y tambien de una columna indexandola.
df1.median()

A     6.0
B    11.0
C    18.0
D    12.0
dtype: float64

In [223]:
#Tambien se puede conocer la desviacion estandar del data frame con .std()
df1.std()

A    5.446712
B    8.544004
C    5.852350
D    5.377422
dtype: float64